In [1]:
import numpy as np
import pandas as pd

In [2]:
data={
    "A":[1,2,np.nan,4,5],
    "B":[3,np.nan,7,8,9],
    "C":[np.nan,12,13,14,15],
    "D":[16,17,18,np.nan,20]
}

In [3]:
df=pd.DataFrame(data)

In [4]:
df

     A    B     C     D
0  1.0  3.0   NaN  16.0
1  2.0  NaN  12.0  17.0
2  NaN  7.0  13.0  18.0
3  4.0  8.0  14.0   NaN
4  5.0  9.0  15.0  20.0

In [5]:
df.isnull()

       A      B      C      D
0  False  False   True  False
1  False   True  False  False
2   True  False  False  False
3  False  False  False   True
4  False  False  False  False

In [6]:
df.isnull().sum()

A    1
B    1
C    1
D    1
dtype: int64

In [7]:
data={
    "A":[1,2,100,4,5],
    "B":[3,np.nan,7,8,9],
    "C":[np.nan,12,13,14,15],
    "D":[16,17,18,np.nan,20]
}

In [8]:
df=pd.DataFrame(data)

In [9]:
df

     A    B     C     D
0    1  3.0   NaN  16.0
1    2  NaN  12.0  17.0
2  100  7.0  13.0  18.0
3    4  8.0  14.0   NaN
4    5  9.0  15.0  20.0

In [10]:
df.dropna()

     A    B     C     D
2  100  7.0  13.0  18.0
4    5  9.0  15.0  20.0

In [11]:
df.dropna(axis=1)

     A
0    1
1    2
2  100
3    4
4    5

In [12]:
df["B"].fillna(df["B"].mean())

0    3.00
1    6.75
2    7.00
3    8.00
4    9.00
Name: B, dtype: float64

In [13]:
df["B"].fillna(df["B"].median())

0    3.0
1    7.5
2    7.0
3    8.0
4    9.0
Name: B, dtype: float64

In [14]:
df["B"].fillna(200000)

0         3.0
1    200000.0
2         7.0
3         8.0
4         9.0
Name: B, dtype: float64

In [15]:
import seaborn as sns

In [16]:
df1=sns.load_dataset("titanic")

In [17]:
df1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [18]:
df1.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [19]:
m=df1[df1["embark_town"].notna()]["embark_town"].mode()

In [20]:
df1["embark_town"].fillna(m)

0      Southampton
1        Cherbourg
2      Southampton
3      Southampton
4      Southampton
          ...
886    Southampton
887    Southampton
888    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 891, dtype: object